app/views/users/show.html.erb


<% @user.videos.each do |v| %>
---
SELECT "videos".* FROM "videos" WHERE ("videos".user_id = 3) ORDER BY popularity desc