app/views/videos/show.html.erb

			<div id="arrow-position">
				<% unless @course.lessons.first == @lesson %>
---
SELECT "lessons".* FROM "lessons" WHERE ("lessons".course_id = 1) ORDER BY lessons.id DESC LIMIT 1

					<li>
						<h1><a href="#"><%= @video.lesson.number.to_s + "/" + @video.lesson.course.lessons.count.to_s %> </a></h1>
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "lessons" WHERE ("lessons".course_id = 1)


<% if @video.lesson.videos.length > 1 %>
---
SELECT "videos".* FROM "videos" WHERE ("videos".lesson_id = 1) ORDER BY popularity desc