app/views/pages/home.html.erb


			<% Course.all.each do |c| %>
---
SELECT "courses".* FROM "courses"

						<h4> <%= c.name %> </h4>
							<% c.lessons.all.each do |l| %>
							<% if l.videos.any? %>
---
SELECT "lessons".* FROM "lessons" WHERE ("lessons".course_id = 1)
SELECT "videos".* FROM "videos" WHERE ("videos".lesson_id = 1) ORDER BY popularity desc LIMIT 1