app/views/lessons/_lesson.html.erb

SELECT "videos".* FROM "videos" WHERE ("videos".lesson_id = 1) ORDER BY popularity desc LIMIT 1
SELECT COUNT(*) FROM "videos" WHERE ("videos".lesson_id = 6)
---
<div class="span-3" id="bottom-left-lesson">
<% if lesson.videos.any? %>