app/views/courses/_course.html.erb

SELECT "lessons".* FROM "lessons" WHERE ("lessons".course_id = 1) LIMIT 1
SELECT COUNT(*) FROM "lessons" WHERE ("lessons".course_id = 1)
---
<h3>
<%= link_to_if course.lessons.any?, course.name, lesson_path(course.lessons.first) %>