app/controllers/courses_controller.rb

INSERT INTO "courses" ("published", "updated_at", "name", "description", "created_at") VALUES (NULL, '2011-04-30 13:59:08.247902', 'Programming Rails', 'How to program in rails', '2011-04-30 13:59:08.247902')
---
  def create
    @course = Course.new(params[:course])

    if @course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 2 LIMIT 1
UPDATE "courses" SET "updated_at" = '2011-05-10 06:58:44.235154', "name" = 'How to speak without confidence', "description" = 'A great course for speak!' WHERE "courses"."id" = 1
---
  def update
    @course = Course.find(params[:id])

    if @course.update_attributes(params[:course])