app/controllers/lessons_controller.rb

  def create
    @lesson = Lesson.new(params[:lesson])

    if @lesson.save
---
INSERT INTO "lessons" ("description", "name", "course_id", "updated_at", "created_at") VALUES ('Something about control', 'Lesson 1: Controllers', 2, '2011-05-10 04:23:59.765878', '2011-05-10 04:23:59.765878')

  def update
    @lesson = Lesson.find(params[:id])
    if @lesson.update_attributes(params[:lesson])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 6 LIMIT 1
UPDATE "lessons" SET "name" = 'Lesson 1: Red', "updated_at" = '2011-05-10 06:32:58.688543', "description" = 'Something about controls' WHERE "lessons"."id" = 6

  def destroy
    @lesson = Lesson.find(params[:id])
    @lesson.destroy
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 5 LIMIT 1
DELETE FROM "lessons" WHERE "lessons"."id" = 5

  def show
    @lesson = Lesson.find(params[:id])
    if @lesson.videos.any?
---
SELECT "lessons".* FROM "lessons" WHERE ("lessons".course_id = 1) ORDER BY id desc
SELECT "videos".* FROM "videos" WHERE ("videos".lesson_id = 1) ORDER BY popularity desc LIMIT 1
SELECT COUNT(*) FROM "videos" WHERE ("videos".lesson_id = 9)

  def edit
    @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 1 LIMIT 1