app/controllers/users_controller.rb

  def show
    @title = User.name
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1