app/controllers/videos_controller.rb

  def index
    @videos = Lesson.all
---
SELECT "lessons".* FROM "lessons"