app/controllers/videos_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 1 LIMIT 1
---
  def index
    @lesson = Lesson.find(params[:lesson_id])

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 3 LIMIT 1
---
  def new
    @lesson = Lesson.find(params[:lesson_id])

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 3 LIMIT 1
INSERT INTO "videos" ("created_at", "updated_at", "title", "description", "lesson_id", "user_id", "youtube_id", "popularity") VALUES ('2011-05-10 03:41:17.880511', '2011-05-10 03:41:17.880511', 'Rails Zombies', 'This is the controller', 6, 5, 'RhLkzfuO1QQ', 0)
---
  def create
    @lesson = Lesson.find(params[:lesson_id])
    @video = Video.new(params[:video])
    @video.lesson_id = params[:lesson_id]
    @video.user_id = current_user.id
    @video.popularity = 0

    if @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 ORDER BY popularity desc LIMIT 1
UPDATE "videos" SET "title" = 'Overcome and Embrace your self', "updated_at" = '2011-05-10 07:26:11.729361' WHERE "videos"."id" = 1
---
  def update
    @video = Video.find(params[:id])
    if @video.update_attributes(params[:video])

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 ORDER BY popularity desc LIMIT 1
DELETE FROM "videos" WHERE "videos"."id" = 1
---
  def destroy
    @video = Video.find(params[:id])
    @video.destroy

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 3 ORDER BY popularity desc LIMIT 1
---
  def show
    @video = Video.find(params[:id])

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = 1 LIMIT 1
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 ORDER BY popularity desc LIMIT 1
---
  def edit
    @lesson = Lesson.find(params[:lesson_id])
    @video = Video.find(params[:id])

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 ORDER BY popularity desc LIMIT 1
---
  def voteup
    Video.find(params[:id]).voteup

SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 ORDER BY popularity desc LIMIT 1
---
  def votedown
    Video.find(params[:id]).votedown